20220516170253-mass_matrix_acts_on_the_correlation_between_position_variables.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-23 Tue 22:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mass matrix acts on the correlation between position variables</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Mass matrix acts on the correlation between position variables</h1>
<dl class="org-dl">
<dt>tags</dt><dd><a href="20220307090810-hamiltonian_monte_carlo.html#ID-dce96ffd-7673-4596-a6e7-2e7dd7299f76">Hamiltonian Monte Carlo</a></dd>
</dl>

<p>
Assume we have an estimate \(\Sigma\) of the covariance matrix for \(q\). One way to improve sampling is to transform the \(q\) so their covariance matrix is close to identity. To do this we write the Cholesky decomposition:
</p>

\begin{equation*}
 \Sigma = L^T\,L
\end{equation*}

<p>
and write \(q' = L^{-1}\,q\). If we use \(K(p) = p^{T}\,p\;/2\) we have independent momenta, almost independent positions and HMC should perform well with a small number of leapfrog steps. This transformation is equivalent to using \(\Sigma\) as the inverse mass matrix:
</p>

\begin{equation*}
 K(p)  = p^{T}\,\Sigma\,p\; / 2
\end{equation*}


<div id="outline-container-orge0e97da" class="outline-2">
<h2 id="orge0e97da">References</h2>
<div class="outline-text-2" id="text-orge0e97da">
<ul class="org-ul">
<li>Neal Radford, MCMC using Hamiltonian dynamics (p 22)</li>
<li>C.H. Bennet, Mass tensor molecular dynamics</li>
</ul>
</div>
</div>

<div id="outline-container-orge262d4d" class="outline-2">
<h2 id="orge262d4d">Links to this note</h2>
</div>
</div>
</body>
</html>
